backend/app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "description", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 24]]
---
  def create
    @course = Course.new(course_params)

    if @course.save
      upload_result = upload_videos
      if upload_result == :success
        render json: { message: 'Curso criado com sucesso', course: @course }, status: :created
      else
        @course.destroy # Rollback if video upload failed

SELECT "videos".* FROM "videos" WHERE "videos"."course_id" = $1  [["course_id", 34]]
---
  def update
    if @course.update(course_params)
      upload_videos if params[:videos].present?

DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 34]]
---
  def destroy
    Rails.logger.debug "Iniciando exclusão do curso: #{params[:id]}"

    if @course.nil?
      Rails.logger.debug "Curso não encontrado: #{params[:id]}"
      render json: { error: 'Curso não encontrado' }, status: :not_found
    elsif @course.destroy

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
  def set_course
    @course = Course.find_by(id: params[:id])

INSERT INTO "videos" ("title", "content_id", "url", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
        break
      end

      if video.save