backend/app/controllers/videos_controller.rb

  def set_course
    @course = Course.find_by(id: params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]